[Ability.A_Eruption H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="爆发"
mTooltip="如果此生物在其回合期间未造成"近战"伤害，则对所有敌方非魔法单位造成 %d 伤害。"

[Ability.A_Eruption_active H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[Ability.A_Eruption_Buff H7BaseBuff]
mName="爆发"
mTooltip=""

[Ability.A_Resurrection H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="元素保护"
mTooltip="增加此生物的 %icon_health 生命值 %stat，并吸收战场上盟友所受伤害的90%，持续 %buff1.buff.durini 回合"

[Ability.A_reuption_test_Buff H7BaseBuff]
mName="爆发"
mTooltip=""

[Ability.A_Tanking_allied_Buff H7BaseBuff]
mName="元素保护"
mTooltip="此生物承受的伤害减少90%，持续 %durnow 回合。"

[Ability.A_Tanking_Buff H7BaseBuff]
mName="元素保护"
mTooltip="此生物获得 %stat %icon_health 额外生命值，并吸收盟友所受伤害的90%，持续 %durnow 回合 "

[Ability.A_Tanking_setting_Buff H7BaseBuff]
mName="元素保护"
mTooltip="此生物获得 %stat %icon_health 额外生命值，并吸收盟友所受伤害的90%，持续 %durnow 回合 "

[Creature.A_Creaturevolcano H7Creature]
mName="硫磺魔像"
mLore="阿尔卡斯的子女非常尊重他们的历史，真正的证据以石质符文板的形式存在，记录了格林海姆生活的所有重要事件。没有人敢质疑其内容，否则有冒犯所有矮人的风险。然而，对传统的严格遵守并不妨碍符文祭司选择性地将信息添加到他们的编年史中。因此，贝格里萨尔——硫磺魔像工人的起源——是许多故事之一，这些故事已经沉入几个世纪的黑暗中没有留下任何痕迹。"

[Creature.A_Creaturevolcano_lv2 H7Creature]
mName="火山魔像"
mLore="托尔-米达尔逐渐扩张引起许多矮人的迷信恐惧，这实际上与贝格里萨尔的活动有关。在遥远的过去，石厅的第一位国王为确保他们支持建造新首都，但他没有履行合同中的他的部分。作为回应，火山魔像继续工作并扩张城市，直到他们收到报酬。随着这些不知疲倦的生物越挖越深，老矮人们开始严重担心，有一天贝格里萨尔可能会到达广阔的岩浆海洋，并用它们淹没首都的地下部分。"

[Secrete_abilityF.A_brasier H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="活体火盆"
mTooltip="秘密能力：当英雄获得20 %icon_defense 防御力或更多时，此生物获得 %stat1 %icon_health 生命值加成，并且 %spell3.name 能力降低目标 %stat2 %icon_attack 攻击力和 %stat3 %icon_movement 移动力，持续2回合。"

[Secrete_abilityF.A_Brasier_Buffcreature H7BaseBuff]
mName=""
mTooltip=""

[Secrete_abilityF.A_Brasier_Buffcreature_marker H7BaseBuff]
mName="标记"
mTooltip=""

[Secrete_abilityF.A_Brasier_Buffhero H7BaseBuff]
mName="活体火盆"
mTooltip=""

[Secrete_abilityF.A_Brasier_deBuffcreature H7BaseBuff]
mName="活体火盆"
mTooltip="此生物获得 %stat1 攻击力 %icon_attack 和 %stat2 移动力 %icon_movement，持续 %durnow 回合。"